# -*- coding: utf-8 -*-
"""
Created on Sat Aug  5 14:55:20 2023

@author: Marko
"""

# стандартне відхилення може бути низьким (маленьке відхилення) та високим (широкий діапазон)
import numpy 
speed = [86,87,88,86,87,85,86]
x = numpy.std(speed)
print(x)

speed = [32,111,138,28,59,77,97]
x = numpy.std(speed)
print(x)
# дисперсія - це число, яке вказує на те, ніскільки розкидані значення
# якщо взяти квадратний корінь з дисперсії, то ви отримаєте стандартне відхилення
x = numpy.var(speed)
print("Дисперія:", x)